import math
MyLocations=tuple
MyLocations=[
    (37.570230,126.982943),
    (37.571573,126.976538),
    (37.576513,126.985386),
    (37.574451,126.957905),
    (37.570457,126.992118)
]
kx=37.575791
ky=126.97349
"""
경복궁역(kx,ky)
종각역(37.570230,126.982943)
광화문역(37.571573,126.976538)
안국역(37.576513,126.985386)
독립문역(37.574451,126.957905)
종로3가역(37.570457,126.992118)
"""
for i in MyLocations:
    print i[0]
for i in MyLocations:
    print i[1]
for i in MyLocations:
    distance=math.sqrt(((kx-i[0])**2+(ky-i[1])**2))
    print distance
distance=[0.0109674030655,0.00520402036891,0.0119178899139,0.0156425005993,0.0193766338666]
print min(distance)